app/Controllers/AdminUser.php

    public function userEdit($userid)
    {
        $modelUser = new ModelUser();
        $modelLevel = new ModelLevel();
        $modelWilayah = new ModelWilayah();
        $modelCabang = new ModelCabang();

        $cekDataUser        = $modelUser->find($userid);
---
SELECT *
FROM `user`
WHERE `user`.`userid` = 'admin'

            'userpassword'      => $cekDataUser['userpassword'],
            'userlevel'         => $cekDataUser['userlevel'],
            'usercabang'        => $cekDataUser['usercabang'],
            'dataLevel'         => $modelLevel->findAll(),
            'dataCabang'        => $modelCabang->findAll()
---
SELECT *
FROM `level`
SELECT *
FROM `cabang`