app/Controllers/AdminBarangMasuk.php

    public function index()
    {
        $modelSuplier = new ModelSuplier();

        $data = [
            'menu' => 'purchasing',
            'submenu' => 'barangmasuk',
            'title' => 'Data Barang Masuk',
            'tampilsuplier' => $modelSuplier->findAll(),
---
SELECT *
FROM `suplier`

    public function hapusTransaksiBarangMasuk()
    {
        if ($this->request->isAJAX()) {
            $faktur = $this->request->getPost('faktur');

            $modelDetail = new ModelBarangMasukDetail();
            $modelBarangMasuk = new ModelBarangMasuk();

            // hapus detail
            $modelDetail->where(['detfaktur' => $faktur]);
            $modelDetail->delete();
            $modelBarangMasuk->delete($faktur);
---
DELETE FROM `barangmasuk_detail`
WHERE `detfaktur` = '12412120001'
DELETE FROM `barangmasuk`
WHERE `faktur` IN ('12412120001')