app/Controllers/AdminStock.php

SELECT *
FROM `cabang`
---
    public function index()
    {
        $modelCabang = new ModelCabang();

        $data = [
            'menu' => 'stockbarang',
            'submenu' => 'stockbarang',
            'title' => 'Data Stock Barang',
            'tampilCabang' => $modelCabang->findAll(),