app/Models/ModelUser.php

SELECT *
FROM `user`
LEFT JOIN `level` ON `userlevel`=`levelid`
LEFT JOIN `wilayah` ON `useralamatid`=`id_wilayah`
LEFT JOIN `cabang` ON `usercabang`=`cabang_id`
---
    public function dataUser()
    {
        return $this->table('user')
            ->join('level', 'userlevel=levelid', 'left')
            ->join('wilayah', 'useralamatid=id_wilayah', 'left')
            ->join('cabang', 'usercabang=cabang_id', 'left')
            ->get();