app/Models/ModelBarangKeluar.php

SELECT max(invoice) as noinvoice
FROM `barangkeluar`
WHERE `tglinvoice` = '2024-12-12'
---
    public function noInvoice($tanggalSekarang)
    {
        return $this->table('barangkeluar')->select('max(invoice) as noinvoice')->where('tglinvoice', $tanggalSekarang)->get();

SELECT *
FROM `barangkeluar`
---
    function totalPenjualan()
    {
        $query = $this->table('barangkeluar')
            ->get();