app/Models/ModelBarangMasuk.php

SELECT max(faktur) as nofaktur
FROM `barangmasuk`
WHERE `tglfaktur` = '2024-12-13'
---
    public function noFaktur($tanggalSekarang)
    {
        return $this->table('barangmasuk')->select('max(faktur) as nofaktur')->where('tglfaktur', $tanggalSekarang)->get();

SELECT *
FROM `barangmasuk`
---
    function totalPembelian()
    {
        $query = $this->table('barangmasuk')
            ->get();