app/Models/ModelStockPagination.php

    public function count_all($cabang_id)
    {
        if ($cabang_id == "") {
            $tbl_storage = $this->db->table($this->table)->join('barang', 'brgid=stock_brgid', 'left')->join('cabang', 'cabang_id=stock_cabang', 'left');
        } else {
            $tbl_storage = $this->db->table($this->table)->join('barang', 'brgid=stock_brgid', 'left')->join('cabang', 'cabang_id=stock_cabang', 'left')->where('stock_cabang', $cabang_id);
        }

        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `stock`
LEFT JOIN `barang` ON `brgid`=`stock_brgid`
LEFT JOIN `cabang` ON `cabang_id`=`stock_cabang`