app/Models/ModelBarangMasukPagination.php

SELECT COUNT(*) AS `numrows`
FROM `barangmasuk`
LEFT JOIN `suplier` ON `idsup`=`supid`
---
    public function count_all($idsup, $tglawal, $tglakhir)
    {
        if ($tglawal == '' && $tglakhir == '') {
            $tbl_storage = $this->db->table($this->table)->join('suplier', 'idsup=supid', 'left');
        } else {
            $tbl_storage = $this->db->table($this->table)->join('suplier', 'idsup=supid', 'left')->like('idsup', $idsup)->where('tglfaktur >=', $tglawal)->where('tglfaktur <=', $tglakhir);
        }

        return $tbl_storage->countAllResults();