app/Models/ModelBarangKeluarTemp.php

SELECT *
FROM `barangkeluar_temp`
JOIN `barang` ON `detbrgid`=`brgid`
WHERE `detinvoice` = '12412120001'
---
    public function tampilDataTemp($noinvoice)
    {
        return $this->table('barangkeluar_temp')->join('barang', 'detbrgid=brgid')->where('detinvoice', $noinvoice)->get();