app/Models/ModelBarangMasukTemp.php

    public function tampilDataTemp($nofaktur)
    {
        return $this->table('barangmasuk_temp')->join('barang', 'detbrgid=brgid')->where('detfaktur', $nofaktur)->get();
---
SELECT *
FROM `barangmasuk_temp`
JOIN `barang` ON `detbrgid`=`brgid`
WHERE `detfaktur` = '22412130001'